--select *
--into dbo.br17373
--from "BOR-LIME-N1-DB".borneo.dbo.br17373

drop table if exists #inf
;
with r as 
(
    select
        r.Id
        , r.DateB
        , r.DateE
        , r.Status
    from Reports.dbo.Report r
    where r.ProjectId = 1
        and r.IsArchiveStatus = 2
        and r.DateB = '20190101'
)

,inf as 
(
    select
        r.DateE
        , rd.ProductId
        , rd.DatediffContractDatePaid * -1 as OverdueDays
        , isnull(rd.ActiveAmt, 0) as ActiveAmt
        , isnull(rd.OverdueAmt, 0) as OverdueAmt
        , isnull(rd.ActivePct, 0) as ActivePct
        , isnull(rd.OverduePct, 0) as OverduePct
    from r
    inner join Reports.dbo.ReportDetail rd on rd.ReportId = r.Id
    where not exists
        (
            select 1 from r r2
            where r.DateE = r2.DateE
                and r2.Id > r.Id
        )
)

select *
into #inf
from inf

alter table #inf add primary key(ProductId, DateE) 
; 

with inf as 
(
    select 
        inf.ProductId
        , sum(iif(inf.DateE = '2019-01-31', ActiveAmt, 0)) as "Активное тело на 2019-01-31" 
        , sum(iif(inf.DateE = '2019-02-28', ActiveAmt, 0)) as "Активное тело на 2019-02-28" 
        , sum(iif(inf.DateE = '2019-03-31', ActiveAmt, 0)) as "Активное тело на 2019-03-31" 
        , sum(iif(inf.DateE = '2019-04-30', ActiveAmt, 0)) as "Активное тело на 2019-04-30" 
        , sum(iif(inf.DateE = '2019-05-31', ActiveAmt, 0)) as "Активное тело на 2019-05-31" 
        , sum(iif(inf.DateE = '2019-06-30', ActiveAmt, 0)) as "Активное тело на 2019-06-30" 
        , sum(iif(inf.DateE = '2019-07-31', ActiveAmt, 0)) as "Активное тело на 2019-07-31" 
        , sum(iif(inf.DateE = '2019-08-31', ActiveAmt, 0)) as "Активное тело на 2019-08-31" 
        , sum(iif(inf.DateE = '2019-09-30', ActiveAmt, 0)) as "Активное тело на 2019-09-30" 
        , sum(iif(inf.DateE = '2019-10-31', ActiveAmt, 0)) as "Активное тело на 2019-10-31" 
        , sum(iif(inf.DateE = '2019-11-30', ActiveAmt, 0)) as "Активное тело на 2019-11-30" 
        , sum(iif(inf.DateE = '2019-12-31', ActiveAmt, 0)) as "Активное тело на 2019-12-31" 
       
        , sum(iif(inf.DateE = '2019-01-31', ActivePct, 0)) as "Активные проценты на 2019-01-31"
        , sum(iif(inf.DateE = '2019-02-28', ActivePct, 0)) as "Активные проценты на 2019-02-28"
        , sum(iif(inf.DateE = '2019-03-31', ActivePct, 0)) as "Активные проценты на 2019-03-31"
        , sum(iif(inf.DateE = '2019-04-30', ActivePct, 0)) as "Активные проценты на 2019-04-30"
        , sum(iif(inf.DateE = '2019-05-31', ActivePct, 0)) as "Активные проценты на 2019-05-31"
        , sum(iif(inf.DateE = '2019-06-30', ActivePct, 0)) as "Активные проценты на 2019-06-30"
        , sum(iif(inf.DateE = '2019-07-31', ActivePct, 0)) as "Активные проценты на 2019-07-31"
        , sum(iif(inf.DateE = '2019-08-31', ActivePct, 0)) as "Активные проценты на 2019-08-31"
        , sum(iif(inf.DateE = '2019-09-30', ActivePct, 0)) as "Активные проценты на 2019-09-30"
        , sum(iif(inf.DateE = '2019-10-31', ActivePct, 0)) as "Активные проценты на 2019-10-31"
        , sum(iif(inf.DateE = '2019-11-30', ActivePct, 0)) as "Активные проценты на 2019-11-30"
        , sum(iif(inf.DateE = '2019-12-31', ActivePct, 0)) as "Активные проценты на 2019-12-31"

        , sum(iif(inf.DateE = '2019-01-31', OverdueAmt, 0)) as "Просроченное тело на 2019-01-31"
        , sum(iif(inf.DateE = '2019-02-28', OverdueAmt, 0)) as "Просроченное тело на 2019-02-28"
        , sum(iif(inf.DateE = '2019-03-31', OverdueAmt, 0)) as "Просроченное тело на 2019-03-31"
        , sum(iif(inf.DateE = '2019-04-30', OverdueAmt, 0)) as "Просроченное тело на 2019-04-30"
        , sum(iif(inf.DateE = '2019-05-31', OverdueAmt, 0)) as "Просроченное тело на 2019-05-31"
        , sum(iif(inf.DateE = '2019-06-30', OverdueAmt, 0)) as "Просроченное тело на 2019-06-30"
        , sum(iif(inf.DateE = '2019-07-31', OverdueAmt, 0)) as "Просроченное тело на 2019-07-31"
        , sum(iif(inf.DateE = '2019-08-31', OverdueAmt, 0)) as "Просроченное тело на 2019-08-31"
        , sum(iif(inf.DateE = '2019-09-30', OverdueAmt, 0)) as "Просроченное тело на 2019-09-30"
        , sum(iif(inf.DateE = '2019-10-31', OverdueAmt, 0)) as "Просроченное тело на 2019-10-31"
        , sum(iif(inf.DateE = '2019-11-30', OverdueAmt, 0)) as "Просроченное тело на 2019-11-30"
        , sum(iif(inf.DateE = '2019-12-31', OverdueAmt, 0)) as "Просроченное тело на 2019-12-31"
        
        , sum(iif(inf.DateE = '2019-01-31', OverduePct, 0)) as "Просроченные проценты на 2019-01-31"
        , sum(iif(inf.DateE = '2019-02-28', OverduePct, 0)) as "Просроченные проценты на 2019-02-28"
        , sum(iif(inf.DateE = '2019-03-31', OverduePct, 0)) as "Просроченные проценты на 2019-03-31"
        , sum(iif(inf.DateE = '2019-04-30', OverduePct, 0)) as "Просроченные проценты на 2019-04-30"
        , sum(iif(inf.DateE = '2019-05-31', OverduePct, 0)) as "Просроченные проценты на 2019-05-31"
        , sum(iif(inf.DateE = '2019-06-30', OverduePct, 0)) as "Просроченные проценты на 2019-06-30"
        , sum(iif(inf.DateE = '2019-07-31', OverduePct, 0)) as "Просроченные проценты на 2019-07-31"
        , sum(iif(inf.DateE = '2019-08-31', OverduePct, 0)) as "Просроченные проценты на 2019-08-31"
        , sum(iif(inf.DateE = '2019-09-30', OverduePct, 0)) as "Просроченные проценты на 2019-09-30"
        , sum(iif(inf.DateE = '2019-10-31', OverduePct, 0)) as "Просроченные проценты на 2019-10-31"
        , sum(iif(inf.DateE = '2019-11-30', OverduePct, 0)) as "Просроченные проценты на 2019-11-30"
        , sum(iif(inf.DateE = '2019-12-31', OverduePct, 0)) as "Просроченные проценты на 2019-12-31"
    
        , sum(iif(inf.DateE = '2019-01-31', OverdueDays, 0)) as "Дней просрочки на 2019-01-31"
        , sum(iif(inf.DateE = '2019-02-28', OverdueDays, 0)) as "Дней просрочки на 2019-02-28"
        , sum(iif(inf.DateE = '2019-03-31', OverdueDays, 0)) as "Дней просрочки на 2019-03-31"
        , sum(iif(inf.DateE = '2019-04-30', OverdueDays, 0)) as "Дней просрочки на 2019-04-30"
        , sum(iif(inf.DateE = '2019-05-31', OverdueDays, 0)) as "Дней просрочки на 2019-05-31"
        , sum(iif(inf.DateE = '2019-06-30', OverdueDays, 0)) as "Дней просрочки на 2019-06-30"
        , sum(iif(inf.DateE = '2019-07-31', OverdueDays, 0)) as "Дней просрочки на 2019-07-31"
        , sum(iif(inf.DateE = '2019-08-31', OverdueDays, 0)) as "Дней просрочки на 2019-08-31"
        , sum(iif(inf.DateE = '2019-09-30', OverdueDays, 0)) as "Дней просрочки на 2019-09-30"
        , sum(iif(inf.DateE = '2019-10-31', OverdueDays, 0)) as "Дней просрочки на 2019-10-31"
        , sum(iif(inf.DateE = '2019-11-30', OverdueDays, 0)) as "Дней просрочки на 2019-11-30"
        , sum(iif(inf.DateE = '2019-12-31', OverdueDays, 0)) as "Дней просрочки на 2019-12-31"
    from #inf inf
    group by inf.ProductId
)

select *
into dbo.br1737inf
from inf
/
select
    "ФИО/Наименование заемщика"
    , "Серия паспорта"
    , "Номер паспорта"
    , "Тип клиента (ФЛ/ИП/ЮЛ)"
    , "ИНН"
    , "Вид займа (микрозайм/онлайн-микрозайм/иные займы/ доп. соглашение)"
    , "Субъект МСП (Да/Нет)"
    , "Номер договора займа/ дополнительного соглашения"
    , "Доп. соглашение к договору займа №"
    , "Содержание доп. соглашения"
    , "Дата заключения договора займа"
    , "Сумма займа по договору (доп. соглашению) в рублях"
    , "Срок займа в днях по договору (продление по доп. соглашению на)"
    , "Дата погашения по договору"
    , "Дата погашения по договору с учетом реструктуризации (при наличии)"
    , "Процентная ставка в процентах годовых"
    , "Территория выдачи (наименование города/населенного пункта, прописка в соответствии с паспортными данными для онлайн-займов)"
    , "Наличие договора залога или поручительства (залог/поручительство/отсутствует)"
    , "Описание предмета залога"
    , "Стоимость залога"
    , "ФИО/наименования залогодателя/ поручителя"
    , "ИНН залогодателя/поручителя"
    , "Стоимость страхования (при наличии)"
    , "Активное тело на 2019-01-31"
    , "Активное тело на 2019-02-28"
    , "Активное тело на 2019-03-31"
    , "Активное тело на 2019-04-30"
    , "Активное тело на 2019-05-31"
    , "Активное тело на 2019-06-30"
    , "Активное тело на 2019-07-31"
    , "Активное тело на 2019-08-31"
    , "Активное тело на 2019-09-30"
    , "Активное тело на 2019-10-31"
    , "Активное тело на 2019-11-30"
    , "Активное тело на 2019-12-31"
    , "Активные проценты на 2019-01-31"
    , "Активные проценты на 2019-02-28"
    , "Активные проценты на 2019-03-31"
    , "Активные проценты на 2019-04-30"
    , "Активные проценты на 2019-05-31"
    , "Активные проценты на 2019-06-30"
    , "Активные проценты на 2019-07-31"
    , "Активные проценты на 2019-08-31"
    , "Активные проценты на 2019-09-30"
    , "Активные проценты на 2019-10-31"
    , "Активные проценты на 2019-11-30"
    , "Активные проценты на 2019-12-31"
    , "Просроченное тело на 2019-01-31"
    , "Просроченное тело на 2019-02-28"
    , "Просроченное тело на 2019-03-31"
    , "Просроченное тело на 2019-04-30"
    , "Просроченное тело на 2019-05-31"
    , "Просроченное тело на 2019-06-30"
    , "Просроченное тело на 2019-07-31"
    , "Просроченное тело на 2019-08-31"
    , "Просроченное тело на 2019-09-30"
    , "Просроченное тело на 2019-10-31"
    , "Просроченное тело на 2019-11-30"
    , "Просроченное тело на 2019-12-31"
    , "Просроченные проценты на 2019-01-31"
    , "Просроченные проценты на 2019-02-28"
    , "Просроченные проценты на 2019-03-31"
    , "Просроченные проценты на 2019-04-30"
    , "Просроченные проценты на 2019-05-31"
    , "Просроченные проценты на 2019-06-30"
    , "Просроченные проценты на 2019-07-31"
    , "Просроченные проценты на 2019-08-31"
    , "Просроченные проценты на 2019-09-30"
    , "Просроченные проценты на 2019-10-31"
    , "Просроченные проценты на 2019-11-30"
    , "Просроченные проценты на 2019-12-31"
    , "Дата образования просроченной задолженности по договору"
    , iif("Дней просрочки на 2019-01-31" < 0, 0, "Дней просрочки на 2019-01-31") as "Дней просрочки на 2019-01-31"
    , iif("Дней просрочки на 2019-02-28" < 0, 0, "Дней просрочки на 2019-02-28") as "Дней просрочки на 2019-02-28"
    , iif("Дней просрочки на 2019-03-31" < 0, 0, "Дней просрочки на 2019-03-31") as "Дней просрочки на 2019-03-31"
    , iif("Дней просрочки на 2019-04-30" < 0, 0, "Дней просрочки на 2019-04-30") as "Дней просрочки на 2019-04-30"
    , iif("Дней просрочки на 2019-05-31" < 0, 0, "Дней просрочки на 2019-05-31") as "Дней просрочки на 2019-05-31"
    , iif("Дней просрочки на 2019-06-30" < 0, 0, "Дней просрочки на 2019-06-30") as "Дней просрочки на 2019-06-30"
    , iif("Дней просрочки на 2019-07-31" < 0, 0, "Дней просрочки на 2019-07-31") as "Дней просрочки на 2019-07-31"
    , iif("Дней просрочки на 2019-08-31" < 0, 0, "Дней просрочки на 2019-08-31") as "Дней просрочки на 2019-08-31"
    , iif("Дней просрочки на 2019-09-30" < 0, 0, "Дней просрочки на 2019-09-30") as "Дней просрочки на 2019-09-30"
    , iif("Дней просрочки на 2019-10-31" < 0, 0, "Дней просрочки на 2019-10-31") as "Дней просрочки на 2019-10-31"
    , iif("Дней просрочки на 2019-11-30" < 0, 0, "Дней просрочки на 2019-11-30") as "Дней просрочки на 2019-11-30"
    , iif("Дней просрочки на 2019-12-31" < 0, 0, "Дней просрочки на 2019-12-31") as "Дней просрочки на 2019-12-31"
from dbo.br17373 br
left join dbo.br1737inf inf on inf.ProductId = br.ProductId

